app/views/auctions/_bids_form.html.erb

      <div class="span2 well">
      <% user_ganador = User.find(@auction.user_ganador) %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2 LIMIT 1