app/views/auctions/_bids_form.html.erb

SELECT "bids".* FROM "bids"  WHERE "bids"."auction_id" = ?  [["auction_id", 1]]
---

    <% @auction.bids.each do |bid| %>

SELECT  1 AS one FROM "bids"  WHERE "bids"."auction_id" = ? AND "bids"."user_id" = 4 LIMIT 1  [["auction_id", 1]]
SELECT "bids"."created_at" FROM "bids"  WHERE "bids"."auction_id" = ? AND "bids"."user_id" = 3  [["auction_id", 1]]
---

  <% elsif @auction.bids.exists?(user_id: current_user.id) %>

SELECT "bids"."reason" FROM "bids"  WHERE "bids"."auction_id" = ? AND "bids"."user_id" = 3  [["auction_id", 1]]
---

    <%= @auction.bids.where(user_id: current_user.id).pluck(:reason).first %>