app/views/auctions/_form.html.erb

SELECT "categories".* FROM "categories"   ORDER BY "categories"."name" ASC
---
		<%= f.label "Categoría" %>
		<%= f.select :category_id, options_from_collection_for_select(Category.all, :id, :name, 25), {}, class: "form-control" %>