app/views/auctions/index.html.erb

	<tbody>
		<% Auction.all.each do |a| %>
---
SELECT  "auctions".* FROM "auctions"   ORDER BY "auctions"."id" ASC LIMIT 1