app/views/auctions/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1
---
			<tr>
	    		<td><%= User.find(@auction.user_id).name %></td>