app/controllers/auctions_controller.rb

  def create
   @auction = Auction.new(params[:auction_params])
    @auction.name = params[:auction][:name]

	 @auction.name = params[:auction][:name]
	 @auction.description = params[:auction][:description]
	 @auction.link = params[:auction][:link]
	 #auction.dayC = params[:dayC]
	 #auction.monthC = params[:monthC]
	 #@auction.category = params[:category]
	 @auction.active = true
	 @auction.user_id = 24
	 if @auction.save
---
INSERT INTO "auctions" ("category_id", "created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 25], ["created_at", "2014-11-29 22:59:33.994830"], ["description", "asdasd"], ["name", "Pantuflas"], ["updated_at", "2014-11-29 22:59:33.994830"], ["user_id", 2]]

  def update
    respond_to do |format|
    #if @auction.owner = current_user
      if @auction.update(auction_params)
---
UPDATE "auctions" SET "category_id" = ?, "updated_at" = ? WHERE "auctions"."id" = 12  [["category_id", 26], ["updated_at", "2014-11-28 22:10:31.952264"]]

  def destroy
	#if ((@auction.owner = current_user) | ((@auction.monthC = Time.month)&(@auction.dayC + 60 = Time.day)))
		@auction.active = false
		@auction.save
---
UPDATE "auctions" SET "active" = ?, "updated_at" = ? WHERE "auctions"."id" = 52  [["active", "f"], ["updated_at", "2014-11-26 13:40:20.403842"]]

  def index
	@auction = Auction.all
---
SELECT  "auctions".* FROM "auctions"   ORDER BY "auctions"."id" ASC LIMIT 1

    def set_auction
      @auction = Auction.find(params[:id])
---
SELECT  "auctions".* FROM "auctions"  WHERE "auctions"."id" = ? LIMIT 1  [["id", 53]]