app/controllers/bids_controller.rb

SELECT  "auctions".* FROM "auctions"  WHERE "auctions"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "bids" ("auction_id", "created_at", "reason", "updated_at") VALUES (?, ?, ?, ?)  [["auction_id", 1], ["created_at", "2014-11-30 02:14:39.120569"], ["reason", "asdasd"], ["updated_at", "2014-11-30 02:14:39.120569"]]
UPDATE "bids" SET "updated_at" = ?, "user_id" = ? WHERE "bids"."id" = 3  [["updated_at", "2014-11-30 04:03:35.221835"], ["user_id", 2]]
---
  def create
    @auction = Auction.find(params[:auction_id])

    @bid = @auction.bids.create(bid_params)
    @bid.user_id = current_user.id
    @bid.save