app/controllers/categories_controller.rb

UPDATE "categories" SET "active" = ?, "updated_at" = ? WHERE "categories"."id" = 1  [["active", "f"], ["updated_at", "2014-11-28 22:45:53.439186"]]
---
  def destroy
    @category.active = !@category.active
    @category.save