app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-26 13:18:28.273060"], ["nombre", "Animales"], ["updated_at", "2014-11-26 13:18:28.273060"]]
---
  def create
  	@category = Category.new(category_params)

    if @category.save