app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
		@user.admin = false
		@user.active = true
    if @user.save
---
INSERT INTO "users" ("activo", "admin", "created_at", "crypted_password", "email", "last_name", "name", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)