app/controllers/user_sessions_controller.rb

  def create
		if @user = login(params[:username], params[:password], params[:remember_me])
			redirect_to(auctions_path, notice: '¡Has iniciado sesión!')
		elsif User.where(username: params[:username], activo: true).blank?
---
SELECT  "users".* FROM "users"  WHERE (username = 'yosolo')  ORDER BY "users"."id" ASC LIMIT 1